Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	СтратегииДоступныДляСчетовДоверительногоУправления(Отказ);	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	КонтрольСменыСтратегии(Отказ);
	
КонецПроцедуры

Процедура СтратегииДоступныДляСчетовДоверительногоУправления(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект.Выгрузить(, "Период,СчетДоверительногоУправления,Стратегия"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НаборЗаписей.Стратегия КАК Стратегия
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НаборЗаписей.Стратегия КАК Стратегия,
		|	СтратегииИндивидуальногоИнвестирования.ВидДоговораДоверительногоУправления КАК ВидДоговораСтратегии,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораСчетаДУ
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _НаборЗаписей.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ПО _НаборЗаписей.Стратегия = СтратегииИндивидуальногоИнвестирования.Ссылка
		|ГДЕ
		|	СтратегииИндивидуальногоИнвестирования.Стандартная
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> СтратегииИндивидуальногоИнвестирования.ВидДоговораДоверительногоУправления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения =
			СтрШаблон(
				"Вид договора стратегии '%1' (%2) не соответствует виду договора счёта внутреннего учёта '%3' (%4) на %5",
				Выборка.Стратегия,
				Выборка.ВидДоговораСтратегии,
				Выборка.СчетДоверительногоУправления,
				Выборка.ВидДоговораСчетаДУ,
				Формат(Выборка.Период, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтрольСменыСтратегии(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтратегииИндивидуальногоИнвестирования.Стратегия КАК Стратегия,
		|	СтратегииИндивидуальногоИнвестирования.Стратегия.Стандартная КАК Стандартная,
		|	СтратегииИндивидуальногоИнвестирования.Период КАК Период
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтратегииИндивидуальногоИнвестирования.Период УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Стратегия)
		|ПО
		|	СчетДоверительногоУправления";
		
	ВыборкаСчетаДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСчетаДУ.Следующий() Цикл
		
		Если ВыборкаСчетаДУ.Стратегия > 1 Тогда
			
			// переход поддерживается только на новую индивидуальную(не стандартную) стратегию
			
			// стратегии отсортированы в порядке убывания, если их больше одной и последняя стандартная
			// значит мы переходим на новую стандартную стратегию
			Выборка = ВыборкаСчетаДУ.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.Стандартная Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Перевод %1 от %2 на новую стандарную стратегию не поддерживается", Выборка.СчетДоверительногоУправления, Выборка.Период),
					Выборка.СчетДоверительногоУправления,,,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;	
	
КонецПроцедуры
